Tekla Open API Reference for Tekla Structures 2025
Parallel.LineSegmentToPlane Method (LineSegment, GeometricPlane)
 Returns true if the given line segment and plane are parallel.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool LineSegmentToPlane(
	LineSegment LineSegment,
	GeometricPlane Plane
)
Public Shared Function LineSegmentToPlane (
	LineSegment As LineSegment,
	Plane As GeometricPlane
) As Boolean
Parameters
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line segment to be used.
Plane
Type: Tekla.Structures.Geometry3d.GeometricPlane
The plane to be used.
Return Value
Type: Boolean
True if the given line segment and plane are parallel.
See Also
Reference
Parallel Class
LineSegmentToPlane Overload
Tekla.Structures.Geometry3d Namespace